In [16]:
import pandas as pd

In [17]:
df = pd.read_csv('titanic.csv')

In [18]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [19]:
df = df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis = 'columns')
df

     Pclass     Sex   Age     Fare  Survived
0         3    male  22.0   7.2500         0
1         1  female  38.0  71.2833         1
2         3  female  26.0   7.9250         1
3         1  female  35.0  53.1000         1
4         3    male  35.0   8.0500         0
..      ...     ...   ...      ...       ...
886       2    male  27.0  13.0000         0
887       1  female  19.0  30.0000         1
888       3  female   NaN  23.4500         0
889       1    male  26.0  30.0000         1
890       3    male  32.0   7.7500         0

[891 rows x 5 columns]

In [20]:
data = df.drop(['Survived'], axis = 'columns')
target = df.Survived

In [21]:
data.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [22]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [23]:
sex_dummies = pd.get_dummies(data.Sex)
sex_dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [24]:
data = pd.concat([data, sex_dummies], axis = 'columns')

In [25]:
data.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [27]:
data = data.drop(['Sex'], axis = 'columns')
data.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [28]:
data.columns[data.isna().any()]

Index(['Age'], dtype='object')

In [29]:
import math
data.Age = data.Age.fillna(math.floor(data.Age.mean()))

In [30]:
data.columns[data.isna().any()]

Index([], dtype='object')

In [31]:
data.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    29.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [33]:
from sklearn.model_selection import train_test_split

In [34]:
x_train, x_test, y_train, y_test = train_test_split(data, target, test_size = 0.25)

In [35]:
from sklearn.naive_bayes import GaussianNB

In [36]:
model = GaussianNB()

In [37]:
model.fit(x_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [38]:
model.score(x_test, y_test)

0.820627802690583

In [39]:
x_test[:10]

     Pclass   Age      Fare  female  male
777       3   5.0   12.4750       1     0
62        1  45.0   83.4750       0     1
593       3  29.0    7.7500       1     0
416       2  34.0   32.5000       1     0
731       3  11.0   18.7875       0     1
272       2  41.0   19.5000       1     0
863       3  29.0   69.5500       1     0
356       1  22.0   55.0000       1     0
537       1  30.0  106.4250       1     0
316       2  24.0   26.0000       1     0

In [40]:
y_test[:10]

777    1
62     0
593    0
416    1
731    0
272    1
863    0
356    1
537    1
316    1
Name: Survived, dtype: int64

In [42]:
model.predict(x_test[:10])

array([1, 0, 1, 1, 0, 1, 1, 1, 1, 1])

In [43]:
model.predict_proba(x_test[:10])

array([[4.25699226e-02, 9.57430077e-01],
       [6.83123149e-01, 3.16876851e-01],
       [7.49307553e-02, 9.25069245e-01],
       [3.55182465e-02, 9.64481754e-01],
       [9.81814359e-01, 1.81856409e-02],
       [3.89354220e-02, 9.61064578e-01],
       [2.86424169e-02, 9.71357583e-01],
       [5.71875242e-03, 9.94281248e-01],
       [6.37747375e-04, 9.99362253e-01],
       [3.42780323e-02, 9.65721968e-01]])

In [45]:
from sklearn.model_selection import cross_val_score
m_score = cross_val_score(GaussianNB(), x_train, y_train, cv = 5)

In [46]:
m_score.mean()

0.7694085961171585